j20-immigration/j20-immigration.org
#+OPTIONS: broken-links:t todo:nil
#+AUTHOR: Hawaii J20
#+hugo_base_dir: /home/dk/Public/projects/958-web-site/public-node/j20-immigration/
#+hugo_auto_set_lastmod: t
** DONE Did my Representative support the Ho`okipa Bill?
   CLOSED: [2018-07-01 Sun 14:16]
   :PROPERTIES:
   :EXPORT_FILE_NAME: state-representatives
   :EXPORT_AUTHOR: "Hawaii J20"
   :EXPORT_HUGO_MENU: :menu "main"
   :END:

*** Question:

Did my representative support the Ho`okipa Bill during the 2018 legislative session?

*** Background:

In the following table, the marks in the =Ho`ikipa= column have these meanings:
=++= introduced the bill and voted aye; =+= voted aye; =+/-= voted aye with
reservations; =-= voted nay. Note that representative names are linked to
legislative web sites with contact information.

Or, [[file:/qgis2web_2018_07_02-15_43_47_875455/index.html][view a map of House districts]], where bluer indicates stronger support for
the Ho`okipa bill and redder is the opposite.

| Dist. | Representative       | Ho`okipa | Party | Areas Represented                                                                                         |
|-------+----------------------+----------+-------+-----------------------------------------------------------------------------------------------------------|
|     1 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=nakashima&year=2018][Mark Nakashima]]       | +        | Dem   | Hāmākua, North and South Hilo                                                                             |
|     2 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=todd&year=2018][Chris Toshiro Todd]]   | +        | Dem   | Keaukaha, parts of Hilo, Pana`ewa, Waiakea                                                                |
|     3 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=onishi&year=2018][Richard Onishi]]       | +        | Dem   | Hilo, Kea`au, Kurtistown, Puna                                                                            |
|     4 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=Sanbuenaventura&year=2018][Joy San Buenaventura]] | +        | Dem   | Puna                                                                                                      |
|     5 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=creagan&year=2018][Richard Creagan]]      | ++       | Dem   | Na'alehu, Ocean View, Captain Cook, Kailua-Kona                                                           |
|     6 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=lowen&year=2018][Nicole Lowen]]         | ++       | Dem   | North Kona, Holualoa, Kalaoa, Honokōhau                                                                   |
|     7 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=evans&year=2018][Cindy Evans]]          | +/-      | Dem   | North Kona, North Kohala, South Kohala                                                                    |
|     8 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=hashimoto&year=2018][Troy Hashimoto]]       | +        | Dem   | Kahakuloa, Waihe`e, Waiehu, Pu`uohala, Wailuku, Kahului                                                   |
|     9 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=woodson&year=2018][Justin Woodson]]       | +        | Dem   | Kahului, Pu`unēnē, Old Sand Hills, Maui Lani                                                              |
|    10 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=mckelvey&year=2018][Angus McKelvey]]       | +        | Dem   | West Maui, Mā`alaea, North Kīhei                                                                          |
|    11 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=ing&year=2018][Kaniela Ing]]          | ++       | Dem   | Kīhei, Wailea, Makena                                                                                     |
|    12 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=yamashita&year=2018][Kyle Yamashita]]       | +        | Dem   | Sprecklesville, Pukalani, Makawao, Kula, Keokea, Ulupalakua, Kahului                                      |
|    13 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=decoite&year=2018][Lynn DeCoite]]         | +        | Dem   | Kalawao, Haiku, Hāna, Kaupo, Kīpahulu, Nahiku, Pā`ia, Kaho`olawe, Lāna`i, Moloka`i, Molokini              |
|    14 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=nakamura&year=2018][Nadine Nakamura]]      | +        | Dem   | Hanalei, Princeville, Kīlauea, Anahola, Kapa`a, Wailua                                                    |
|    15 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=tokioka&year=2018][James Tokioka]]        | +/-      | Dem   | Wailuā Homesteads, Hanamā`ulu, Līhu`e, Puhi, Old Kōloa Town, `Ōma`o                                       |
|    16 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=morikawa&year=2018][Dee Morikawa]]         | +        | Dem   | Ni`ihau, Lehua, Kōloa, Waimea                                                                             |
|    17 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=ward&year=2018][Gene Ward]]            | -        | Rep   | Honolulu, Hawai`i Kai, Kalama Valley                                                                      |
|    18 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=hashem&year=2018][Mark Hashem]]          | +/-      | Dem   | Haha`ione, Kuliouou, Niu Valley, `Āina Haina, Wai`alae, Kāhala                                            |
|    19 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=kobayashi&year=2018][Bertrand Kobayashi]]   | +        | Dem   | Wai`alae-Kāhala, Diamond Head, Kaimuki, Kapahulu                                                          |
|    20 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=say&year=2018][Calvin K.Y. Say]]      | +        | Dem   | St. Louis Heights, Pālolo Valley, Maunalani Heights, Wilhelmina Rise, Kaimukī                             |
|    21 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=nishimoto&year=2018][Scott Nishimoto]]      | +        | Dem   | Mō`ili`ili, McCully, Kaimukī                                                                              |
|    22 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=brower&year=2018][Tom Brower]]           | ++       | Dem   | Waikīkī, Ala Moana                                                                                        |
|    23 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=choy&year=2018][Isaac Choy]]           | +/-      | Dem   | Mānoa, Punahou, University, Mō`ili`ili                                                                    |
|    24 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=belatti&year=2018][Della Au Belatti]]     | +        | Dem   | Makiki, Tantalus, Papakōlea, McCully, Pawa`a, Manoa                                                       |
|    25 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=luke&year=2018][Sylvia Luke]]          | +/-      | Dem   | Makiki, Punchbowl, Nu`uanu, Dowsett Highlands, Pacific Heights, Pauoa                                     |
|    26 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=saiki&year=2018][Scott Saiki]]          | +        | Dem   | McCully, Kaheka, Kaka`ako, Downtown Honolulu                                                              |
|    27 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=johanson&year=2018][Takashi Ohno]]         | +        | Dem   | Nu`uanu, Liliha, Pauoa, `Ālewa Heights                                                                    |
|    28 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=mizuno&year=2018][John Mizuno]]          | +        | Dem   | Kalihi Valley, Kamehameha Heights, portion of lower Kalihi                                                |
|    29 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=holt&year=2018][Daniel Holt]]          | +        | Dem   | Kalihi, Kapālama, Iwilei, Chinatown                                                                       |
|    30 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=cachola&year=2018][Romy Cachola]]         | +        | Dem   | Sand Island, Mokauea, Kapalama, Kalihi Kai                                                                |
|    31 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=johanson&year=2018][Aaron Johanson]]       | +        | Dem   | Moanalua, Red Hill, Foster Village, `Aiea, Fort Shafter, Moanalua Gardens, Aliamanu, Lower Pearlridge     |
|    32 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=ichiyama&year=2018][Linda Ichiyama]]       | +        | Dem   | Moanalua Valley, Salt Lake, Aliamanu                                                                      |
|    33 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=kong&year=2018][Sam Kong]]             | +        | Dem   | `Aiea                                                                                                     |
|    34 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=takayama&year=2018][Gregg Takayama]]       | +/-      | Dem   | Pearl City, Waimalu, Pacific Palisades                                                                    |
|    35 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=takumi&year=2018][Roy Takumi]]           | +        | Dem   | Pearl City, Mānana, Waipi`o                                                                               |
|    36 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=fukumoto&year=2018][Beth Fukumoto]]        | +        | Dem   | Mililani, Mililani Mauka                                                                                  |
|    37 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=yamane&year=2018][Ryan Yamane]]          | +        | Dem   | Mililani, Waipi`o Gentry, Waikele                                                                         |
|    38 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=aquino&year=2018][Henry Aquino]]         | +        | Dem   | Waipahu                                                                                                   |
|    39 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=cullen&year=2018][Ty Cullen]]            | +        | Dem   | Royal Kunia, Village Park, Waipahu, Makakilo, West Loch                                                   |
|    40 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=mcdermott&year=2018][Bob McDermott]]        | -        | Rep   | `Ewa, `Ewa Beach, `Ewa Gentry, Iroquois Point                                                             |
|    41 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=LoPresti&year=2018][Matthew LoPresti]]     | +        | Dem   | `Ewa Villages, `Ewa Beach, Ewa Gentry, Ocean Pointe, West Loch                                            |
|    42 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=har&year=2018][Sharon Har]]           | +/-      | Dem   | Kapolei, Makakilo                                                                                         |
|    43 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=Tupola&year=2018][Andria Tupola]]        | -        | Rep   | `Ewa Villages, Kalaeloa, Honokai Hale, Nanakai Gardens, Ko Olina, Kahe Point, Nānākuli, Lualualei, Mā`ili |
|    44 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=gates&year=2018][Cedric Gates]]         | +        | Dem   | Wai`anae, Mākaha, Makua, Mā`ili                                                                           |
|    45 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=matsumoto&year=2018][Lauren Matsumoto]]     | -        | Rep   | Schofield, Mokuleia, Waialua, Kunia, Waipi`o Acres, Mililani                                              |
|    46 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=learmont&year=2018][Leah Learmont]]        | +        | Dem   | Wahiawa, Whitmore Village                                                                                 |
|    47 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=quinlan&year=2018][Sean Quinlan]]         | +        | Dem   | Waialua, Haleiwa, Pupukea, Kahuku, Laie, Hau`ula, Waiāhole, Sunset Beach, Punalu`u, Ka`a`awa              |
|    48 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=Keohokalole&year=2018][Jarrett Keohokalole]]  | ++       | Dem   | Kāne`ohe, He`eia, Ahuimanu, Kahalu`u, Ha`ikū Valley, Mokuoloe                                             |
|    49 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=hashimoto&year=2018][Ken Ito]]              | +        | Dem   | Kāne`ohe, Maunawili, Olomana                                                                              |
|    50 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=thielen&year=2018][Cynthia Thielen]]      | -        | Rep   | Kailua, Kāne`ohe Bay                                                                                      |
|    51 | [[https://www.capitol.hawaii.gov/memberpage.aspx?member=clee&year=2018][Chris Lee]]            | +        | Dem   | Lanikai, Waimānalo                                                                                        |

*** Answer:

In meetings prior to the 2018 session, House leaders made clear to Hawai`i J20
and other supportive groups that the Ho`okipa Bill would not pass the
legislature in 2018. Still, support for the Ho`okipa Bill was strong.

Support for the 2018 Ho`okipa Bill, introduced by Representatives Ing, Brower,
Creagan, Keohokalole, and Lowen, was divided along party lines. Thirty-nine
Democrats supported the bill, while all five Republicans voted against it. Seven
Democrats were "on the fence," either voting with reservations or, in the case
of Representatives Luke and Takayama, refusing to hear the bill in committee.

Technically, the refusals by Representative Luke to hear the House version of
the Ho`okipa Bill in the Finance Committee and by Representative Takayama to
hear the Senate version of the Ho`okipa Bill in the Public Safety Committee
killed the 2018 Ho`okipa Bill.

