j20-immigration/content/post/state-representatives.md
+++
title = "Did my Representative support the Ho`okipa Bill?"
author = ["Hawaii J20"]
date = 2018-07-01T14:16:00-10:00
lastmod = 2018-08-04T18:04:09-10:00
draft = false
[menu.main]
  weight = 2013
  identifier = "did-my-representative-support-the-ho-okipa-bill"
+++

## Question: {#question}

Did my representative support the Ho\`okipa Bill during the 2018 legislative session?


## Background: {#background}

In the following table, the marks in the ``Ho`ikipa`` column have these meanings:
`++` introduced the bill and voted aye; `+` voted aye; `+/-` voted aye with
reservations; `-` voted nay. Note that representative names are linked to
legislative web sites with contact information.

Or, [view a map of House districts](/qgis2web_2018_07_02-15_43_47_875455/index.html), where bluer indicates stronger support for
the Ho\`okipa bill and redder is the opposite.

| Dist. | Representative                                                                                          | Ho\`okipa | Party | Areas Represented                                                                                           |
|-------|---------------------------------------------------------------------------------------------------------|-----------|-------|-------------------------------------------------------------------------------------------------------------|
| 1     | [Mark Nakashima](https://www.capitol.hawaii.gov/memberpage.aspx?member=nakashima&year=2018)             | +         | Dem   | Hāmākua, North and South Hilo                                                                               |
| 2     | [Chris Toshiro Todd](https://www.capitol.hawaii.gov/memberpage.aspx?member=todd&year=2018)              | +         | Dem   | Keaukaha, parts of Hilo, Pana\`ewa, Waiakea                                                                 |
| 3     | [Richard Onishi](https://www.capitol.hawaii.gov/memberpage.aspx?member=onishi&year=2018)                | +         | Dem   | Hilo, Kea\`au, Kurtistown, Puna                                                                             |
| 4     | [Joy San Buenaventura](https://www.capitol.hawaii.gov/memberpage.aspx?member=Sanbuenaventura&year=2018) | +         | Dem   | Puna                                                                                                        |
| 5     | [Richard Creagan](https://www.capitol.hawaii.gov/memberpage.aspx?member=creagan&year=2018)              | ++        | Dem   | Na'alehu, Ocean View, Captain Cook, Kailua-Kona                                                             |
| 6     | [Nicole Lowen](https://www.capitol.hawaii.gov/memberpage.aspx?member=lowen&year=2018)                   | ++        | Dem   | North Kona, Holualoa, Kalaoa, Honokōhau                                                                     |
| 7     | [Cindy Evans](https://www.capitol.hawaii.gov/memberpage.aspx?member=evans&year=2018)                    | +/-       | Dem   | North Kona, North Kohala, South Kohala                                                                      |
| 8     | [Troy Hashimoto](https://www.capitol.hawaii.gov/memberpage.aspx?member=hashimoto&year=2018)             | +         | Dem   | Kahakuloa, Waihe\`e, Waiehu, Pu\`uohala, Wailuku, Kahului                                                   |
| 9     | [Justin Woodson](https://www.capitol.hawaii.gov/memberpage.aspx?member=woodson&year=2018)               | +         | Dem   | Kahului, Pu\`unēnē, Old Sand Hills, Maui Lani                                                               |
| 10    | [Angus McKelvey](https://www.capitol.hawaii.gov/memberpage.aspx?member=mckelvey&year=2018)              | +         | Dem   | West Maui, Mā\`alaea, North Kīhei                                                                           |
| 11    | [Kaniela Ing](https://www.capitol.hawaii.gov/memberpage.aspx?member=ing&year=2018)                      | ++        | Dem   | Kīhei, Wailea, Makena                                                                                       |
| 12    | [Kyle Yamashita](https://www.capitol.hawaii.gov/memberpage.aspx?member=yamashita&year=2018)             | +         | Dem   | Sprecklesville, Pukalani, Makawao, Kula, Keokea, Ulupalakua, Kahului                                        |
| 13    | [Lynn DeCoite](https://www.capitol.hawaii.gov/memberpage.aspx?member=decoite&year=2018)                 | +         | Dem   | Kalawao, Haiku, Hāna, Kaupo, Kīpahulu, Nahiku, Pā\`ia, Kaho\`olawe, Lāna\`i, Moloka\`i, Molokini            |
| 14    | [Nadine Nakamura](https://www.capitol.hawaii.gov/memberpage.aspx?member=nakamura&year=2018)             | +         | Dem   | Hanalei, Princeville, Kīlauea, Anahola, Kapa\`a, Wailua                                                     |
| 15    | [James Tokioka](https://www.capitol.hawaii.gov/memberpage.aspx?member=tokioka&year=2018)                | +/-       | Dem   | Wailuā Homesteads, Hanamā\`ulu, Līhu\`e, Puhi, Old Kōloa Town, \`Ōma\`o                                     |
| 16    | [Dee Morikawa](https://www.capitol.hawaii.gov/memberpage.aspx?member=morikawa&year=2018)                | +         | Dem   | Ni\`ihau, Lehua, Kōloa, Waimea                                                                              |
| 17    | [Gene Ward](https://www.capitol.hawaii.gov/memberpage.aspx?member=ward&year=2018)                       | -         | Rep   | Honolulu, Hawai\`i Kai, Kalama Valley                                                                       |
| 18    | [Mark Hashem](https://www.capitol.hawaii.gov/memberpage.aspx?member=hashem&year=2018)                   | +/-       | Dem   | Haha\`ione, Kuliouou, Niu Valley, \`Āina Haina, Wai\`alae, Kāhala                                           |
| 19    | [Bertrand Kobayashi](https://www.capitol.hawaii.gov/memberpage.aspx?member=kobayashi&year=2018)         | +         | Dem   | Wai\`alae-Kāhala, Diamond Head, Kaimuki, Kapahulu                                                           |
| 20    | [Calvin K.Y. Say](https://www.capitol.hawaii.gov/memberpage.aspx?member=say&year=2018)                  | +         | Dem   | St. Louis Heights, Pālolo Valley, Maunalani Heights, Wilhelmina Rise, Kaimukī                               |
| 21    | [Scott Nishimoto](https://www.capitol.hawaii.gov/memberpage.aspx?member=nishimoto&year=2018)            | +         | Dem   | Mō\`ili\`ili, McCully, Kaimukī                                                                              |
| 22    | [Tom Brower](https://www.capitol.hawaii.gov/memberpage.aspx?member=brower&year=2018)                    | ++        | Dem   | Waikīkī, Ala Moana                                                                                          |
| 23    | [Isaac Choy](https://www.capitol.hawaii.gov/memberpage.aspx?member=choy&year=2018)                      | +/-       | Dem   | Mānoa, Punahou, University, Mō\`ili\`ili                                                                    |
| 24    | [Della Au Belatti](https://www.capitol.hawaii.gov/memberpage.aspx?member=belatti&year=2018)             | +         | Dem   | Makiki, Tantalus, Papakōlea, McCully, Pawa\`a, Manoa                                                        |
| 25    | [Sylvia Luke](https://www.capitol.hawaii.gov/memberpage.aspx?member=luke&year=2018)                     | +/-       | Dem   | Makiki, Punchbowl, Nu\`uanu, Dowsett Highlands, Pacific Heights, Pauoa                                      |
| 26    | [Scott Saiki](https://www.capitol.hawaii.gov/memberpage.aspx?member=saiki&year=2018)                    | +         | Dem   | McCully, Kaheka, Kaka\`ako, Downtown Honolulu                                                               |
| 27    | [Takashi Ohno](https://www.capitol.hawaii.gov/memberpage.aspx?member=johanson&year=2018)                | +         | Dem   | Nu\`uanu, Liliha, Pauoa, \`Ālewa Heights                                                                    |
| 28    | [John Mizuno](https://www.capitol.hawaii.gov/memberpage.aspx?member=mizuno&year=2018)                   | +         | Dem   | Kalihi Valley, Kamehameha Heights, portion of lower Kalihi                                                  |
| 29    | [Daniel Holt](https://www.capitol.hawaii.gov/memberpage.aspx?member=holt&year=2018)                     | +         | Dem   | Kalihi, Kapālama, Iwilei, Chinatown                                                                         |
| 30    | [Romy Cachola](https://www.capitol.hawaii.gov/memberpage.aspx?member=cachola&year=2018)                 | +         | Dem   | Sand Island, Mokauea, Kapalama, Kalihi Kai                                                                  |
| 31    | [Aaron Johanson](https://www.capitol.hawaii.gov/memberpage.aspx?member=johanson&year=2018)              | +         | Dem   | Moanalua, Red Hill, Foster Village, \`Aiea, Fort Shafter, Moanalua Gardens, Aliamanu, Lower Pearlridge      |
| 32    | [Linda Ichiyama](https://www.capitol.hawaii.gov/memberpage.aspx?member=ichiyama&year=2018)              | +         | Dem   | Moanalua Valley, Salt Lake, Aliamanu                                                                        |
| 33    | [Sam Kong](https://www.capitol.hawaii.gov/memberpage.aspx?member=kong&year=2018)                        | +         | Dem   | \`Aiea                                                                                                      |
| 34    | [Gregg Takayama](https://www.capitol.hawaii.gov/memberpage.aspx?member=takayama&year=2018)              | +/-       | Dem   | Pearl City, Waimalu, Pacific Palisades                                                                      |
| 35    | [Roy Takumi](https://www.capitol.hawaii.gov/memberpage.aspx?member=takumi&year=2018)                    | +         | Dem   | Pearl City, Mānana, Waipi\`o                                                                                |
| 36    | [Beth Fukumoto](https://www.capitol.hawaii.gov/memberpage.aspx?member=fukumoto&year=2018)               | +         | Dem   | Mililani, Mililani Mauka                                                                                    |
| 37    | [Ryan Yamane](https://www.capitol.hawaii.gov/memberpage.aspx?member=yamane&year=2018)                   | +         | Dem   | Mililani, Waipi\`o Gentry, Waikele                                                                          |
| 38    | [Henry Aquino](https://www.capitol.hawaii.gov/memberpage.aspx?member=aquino&year=2018)                  | +         | Dem   | Waipahu                                                                                                     |
| 39    | [Ty Cullen](https://www.capitol.hawaii.gov/memberpage.aspx?member=cullen&year=2018)                     | +         | Dem   | Royal Kunia, Village Park, Waipahu, Makakilo, West Loch                                                     |
| 40    | [Bob McDermott](https://www.capitol.hawaii.gov/memberpage.aspx?member=mcdermott&year=2018)              | -         | Rep   | \`Ewa, \`Ewa Beach, \`Ewa Gentry, Iroquois Point                                                            |
| 41    | [Matthew LoPresti](https://www.capitol.hawaii.gov/memberpage.aspx?member=LoPresti&year=2018)            | +         | Dem   | \`Ewa Villages, \`Ewa Beach, Ewa Gentry, Ocean Pointe, West Loch                                            |
| 42    | [Sharon Har](https://www.capitol.hawaii.gov/memberpage.aspx?member=har&year=2018)                       | +/-       | Dem   | Kapolei, Makakilo                                                                                           |
| 43    | [Andria Tupola](https://www.capitol.hawaii.gov/memberpage.aspx?member=Tupola&year=2018)                 | -         | Rep   | \`Ewa Villages, Kalaeloa, Honokai Hale, Nanakai Gardens, Ko Olina, Kahe Point, Nānākuli, Lualualei, Mā\`ili |
| 44    | [Cedric Gates](https://www.capitol.hawaii.gov/memberpage.aspx?member=gates&year=2018)                   | +         | Dem   | Wai\`anae, Mākaha, Makua, Mā\`ili                                                                           |
| 45    | [Lauren Matsumoto](https://www.capitol.hawaii.gov/memberpage.aspx?member=matsumoto&year=2018)           | -         | Rep   | Schofield, Mokuleia, Waialua, Kunia, Waipi\`o Acres, Mililani                                               |
| 46    | [Leah Learmont](https://www.capitol.hawaii.gov/memberpage.aspx?member=learmont&year=2018)               | +         | Dem   | Wahiawa, Whitmore Village                                                                                   |
| 47    | [Sean Quinlan](https://www.capitol.hawaii.gov/memberpage.aspx?member=quinlan&year=2018)                 | +         | Dem   | Waialua, Haleiwa, Pupukea, Kahuku, Laie, Hau\`ula, Waiāhole, Sunset Beach, Punalu\`u, Ka\`a\`awa            |
| 48    | [Jarrett Keohokalole](https://www.capitol.hawaii.gov/memberpage.aspx?member=Keohokalole&year=2018)      | ++        | Dem   | Kāne\`ohe, He\`eia, Ahuimanu, Kahalu\`u, Ha\`ikū Valley, Mokuoloe                                           |
| 49    | [Ken Ito](https://www.capitol.hawaii.gov/memberpage.aspx?member=hashimoto&year=2018)                    | +         | Dem   | Kāne\`ohe, Maunawili, Olomana                                                                               |
| 50    | [Cynthia Thielen](https://www.capitol.hawaii.gov/memberpage.aspx?member=thielen&year=2018)              | -         | Rep   | Kailua, Kāne\`ohe Bay                                                                                       |
| 51    | [Chris Lee](https://www.capitol.hawaii.gov/memberpage.aspx?member=clee&year=2018)                       | +         | Dem   | Lanikai, Waimānalo                                                                                          |


## Answer: {#answer}

In meetings prior to the 2018 session, House leaders made clear to Hawai\`i J20
and other supportive groups that the Ho\`okipa Bill would not pass the
legislature in 2018. Still, support for the Ho\`okipa Bill was strong.

Support for the 2018 Ho\`okipa Bill, introduced by Representatives Ing, Brower,
Creagan, Keohokalole, and Lowen, was divided along party lines. Thirty-nine
Democrats supported the bill, while all five Republicans voted against it. Seven
Democrats were "on the fence," either voting with reservations or, in the case
of Representatives Luke and Takayama, refusing to hear the bill in committee.

Technically, the refusals by Representative Luke to hear the House version of
the Ho\`okipa Bill in the Finance Committee and by Representative Takayama to
hear the Senate version of the Ho\`okipa Bill in the Public Safety Committee
killed the 2018 Ho\`okipa Bill.
